local function GET_TEXT(msg)
if chat_type == 'super' then 
if not mohmadDEVBEROm:get(DEVBERO..'lock:reoly:bot'..msg.chat_id_) then
if text == "هلو" or text == "هلاو" or text == "هلوو" or text == "هاي" then 
local mohmad = {'هلاوات 😻 مشعشع 💫','اهلا وسهلا 💔','😩كل شويه يجي واحد واكلة هلو😖 والله مليت 🤕🙌','Hello😻, my friend😿, how are you👮','😎كل هلا بك في كروبنا 🤕 نورت😼'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad[math.random(#mohmad)], 1, 'html')  
end 
if text == 'بوت' then
local mohmad = {'   نجب لك صارت قديمه صيحلي باسمي 😒💛','ها احجي شتريد 😏 صيحلي باسمي بعد لدكول بوت😢   ','  لۧاٲ   مو بوت اقرا اسمي✨ ',' نْجٍبْ لُگ عنْدِيَ آسم ۆصٍيَحٍـنْيَ بْيَة 😟😤ّ'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1, ''..mohmad[math.random(#mohmad)]..'', 1, 'md') 
end 
if text == "شلونك" or text == "شلونكم"then 
local mohmad = {'😹اني بلنسبه الي دايح 👻 شوف بقية الاعضاء😴','😕الحمد •للّـ🙏ّـرب وانته/ي 🤔','😡كل شويه واحد يكلي شلونك😪 وشلونكم عمي كلنه بخير كمل🤐','زين واسيا واثير 😹 ادري قديمه انجب 😷'}
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad[math.random(#mohmad)], 1, 'html')  
end 
if text == "تحبني" then 
local mohmad1 = {'😱شلون ما احبك/ج💔 كفشة روحي 😠','احّ ـّـٌٍ❣ـٍّبّكَ و تحبني واثنينه مغلسين 😔',' 😕ما احبك 😹 طن بلكصة 😅','✋🏽عذرا مكبل💔 لتزحف/ين'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad1[math.random(#mohmad1)], 1, 'html')  
end 
if text == "شيعي" or text == "سني" then 
local mohmad2 = {'😡لا تصير طائفي زمال🌚📿','🙄بدت رحمه •اللّـہ كلنه عراققين 🇮🇶 انجب✋🏽'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad2[math.random(#mohmad2)], 1, 'html')  
end 
if text == "شكو ماكو" then 
local mohmad3 = {'غيرك بل كلب❤️ ماكو','😓صافية دافية','☹️كلشي ماكو ع حطت ايد👌🏾 ',' لعراق سوة صاروخ نووي🎃'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad3[math.random(#mohmad3)], 1, 'html')  
end 
if text == "شنو اسمك" or text == "شسمك" then 
local mohmad4 = {'🆔اسمي مكتووب يا خرة💩','🐸لتزحف عزيزي✋🏽','🐸عوف اسمي وانطيني رقمك بلخاص ههه🙊'} 
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad4[math.random(#mohmad4)], 1, 'html')  
end 
if text == "روعة" or text == "روعه" then
local mohmad5 = {'😍مروك الاروع👌😌',' ✋🏽انَـَY̷̳̜̩̐̌̋O̷̳̜̩̐̌̋U̷̳̜̩̐̌̋ـَتَه الاروع حبي😚'}
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad5[math.random(#mohmad5)], 1, 'html') 
end
if text == "غني" or text == "غنيلي" then 
local mohmad6 = {'☺️حلو حلو شكد حلو هواي حلو رقمي😻 ******07727 تعال خاص اكملك 😹🙌','😿هذا حبيبي احبك كولش🤕 كولش احبة🤐 واتحدة واحد بلبشر مثلي يحبة😒','😜حغنيلكم ام الاحمر 💄 *وا يلا مع سلامة بيباي يا غرمة محافضها 😓🤒' }
end
if text == "باي" or text == "بيباي" or text == "جاو" then 
local mohmad7 = {'good bay 👮✋🏽','بيباي يعمري 😚','😡كل شوية واحد يروح 🚶كافيعاد 🙏','الله وياك بحي😿'}
end
if text == "اقرالي دعاء" then
local mohmad8 = {'اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭👁️‍🗨️ اللهم عذب ام العربي وحولها الى بائعه البلبي 😿 اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية🙌 اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ🌚 اللهم عذب ام الاحياء واجعلها كل مومياء🕸🎃 اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂','🙏اللهم يعقلك ويكبرك شويونه ع الاقل👌🏾🐸'}
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad8[math.random(#mohmad8)], 1, 'html') 
end
if text == "هه" or text == "ههه" or text == "هههه" or text == "ههههه" or text == "😂" or text == "😹" or text == "ههههاي" or text == "😅" then
local mohmad9 = {'🙂{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}😇','دوم حبي ❤️👁️‍🗨️','ربي يدمها هلضحكة 🙊💫'}
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad9[math.random(#mohmad9)], 1, 'html') 
end
if text == "فدوة" or text == "فديتك" or text == "فديتج" then
local mohmad10 = {'😘فدِآكـ آلكؤن🙈ؤمَآي آَلَعيـونْ😚ؤقوآطيْ المَعجَون❤️🙊😋','😢واني محد يكلي فديتك 😭😭','😒لتضل تفدي هذا وذاك😕 انجب واسكت 👌😌'}
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad10[math.random(#mohmad10)], 1, 'html') 
end
end


end
end
local function help_rep(msg, MSG_TEXT)
if chat_type == 'super' then 
if MSG_TEXT[1] == 'تفعيل ردود البوت' and is_monsh(msg) then   
if mohmadDEVBEROm:get(DEVBERO..'lock:reoly:bot'..msg.chat_id_) then
mohmad = '*☑┇ تم تفعيل ردود البوت *\n✓' 
berof_sendMsg( msg.chat_id_, msg.id_, 1, mohmad, 1, "md") 
mohmadDEVBEROm:del(DEVBERO..'lock:reoly:bot'..msg.chat_id_) 
else
mohmad = '*☑┇ بالتاكيد تم تفعيل ردود البوت *\n✓' 
berof_sendMsg( msg.chat_id_, msg.id_, 1, mohmad, 1, "md") 
end
end
if MSG_TEXT[1] == 'تعطيل ردود البوت' and is_monsh(msg) then   
if not mohmadDEVBEROm:get(DEVBERO..'lock:reoly:bot'..msg.chat_id_) then
mohmad = '*☑┇ تم تعطيل ردود البوت *\n✓' 
berof_sendMsg( msg.chat_id_, msg.id_, 1, mohmad, 1, "md") 
mohmadDEVBEROm:set(DEVBERO..'lock:reoly:bot'..msg.chat_id_,true) 
else
mohmad = '*☑┇ بالتاكيد تم تعطيل ردود البوت *\n✓' 
berof_sendMsg( msg.chat_id_, msg.id_, 1, mohmad, 1, "md") 
end
end
if MSG_TEXT[1] == 'رابط الحذف' or MSG_TEXT[1] == 'رابط حذف' or MSG_TEXT[1] == 'راح احذف' or MSG_TEXT[1] == 'اريد احذف' then
local delac = [[*
📤┇ رابط حذف حـساب التلكرام
📊┇ احذف وشوف حياتك...
🗞┇ بالتـوفيـق عزيزي ...*
📜┇ [اضغط هنا لحذف حسابك](https://telegram.org/deactivate)
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,delac, 1, 'md')
 end

if MSG_TEXT[1] == 'الاوامر' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن الادمنيه ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*✳️┇ اهلآ بك، في اوامر البوت
 ٴ━━━━━━━━━━
🔘┇ م1 » لعرض قائمه الحمايه
🔘┇ م2 » لعرض اوامر الاعضاء
🔘┇ م3   » لعرض قائمه الحظر
🔘┇ م4 » لعرض قائمه الادمنيه
 ٴ━━━━━━━━━━
🔘┇ م5 » لعرض اوامر المدراء
🔘┇ م6 » لعرض اوامر المنشئين
🔘┇ م7 » لعرض اوامر المطور
🔘┇ م8 » لعرض اوامر المطور الاساسي
 ٴ━━━━━━━━━━
⚜️┇ للمزيد من المعلومات راسلنا  ࿈
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end
if MSG_TEXT[1] == 'م1' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن الادمنيه ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🌐 ┇ اهلا بك في اوامر القفل
🔐 ┇ ڨفلٰ ‹› ڤتح » الامر
ٴ━━━━━━━━━━
🔘┇ الروابط «» الكلايش
🔘┇ المعرفات «» اللستات
🔘┇ التاك «» الصوت 
🔘┇ البوتات «» المتحركه
🔘┇ التوجيه «» الدردشه
🔘┇ التثبيت «» الملفات
🔘┇ الاشعارات «» الفيديو
🔘┇ الماركدون «» الاغاني
🔘┇ التعديل «» الالعاب
🔘┇ تعديل الميديا «» الصور
🔘┇ الملصقات «» السيلفي
🔘┇ الجهات «» الدخول «» الاضافه
 ٴ━━━━━━━━━━
♦┇ للمزيد من الاوامر ارسل ↓
🚫┇ اوامر الكتم » لعرض اوامر الكتم
🔰┇ اوامر التقيد » لعرض اوامر التقيد
🔘┇ اوامر الطرد » لعرض اوامر الطرد
 ٴ━━━━━━━━━━
⚜️┇ للمزيد من المعلومات راسلنا  ࿈
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end
if MSG_TEXT[1] == 'م2' then
mohmad = [[
*🔘┇ مرحبا بك 
📋┇ في اوامــر الآعضاء
ٴ━━━━━━━━━━
🔘┇ عرض معلوماتك ↑↓
 ٴ━━━━━━━━━━
📋┇ معرفي – اسمي – معلوماتي
🗑┇ رسايلي – مسح رسايلي 
📊┇ رتبتي – صورتي + رقم الصوره
📤┇ جلب صوره — ثم ارسل رقم الصوره
ٴ━━━━━━━━━━
🔘┇ اوآمر المجموعه ↑↓
 ٴ━━━━━━━━━━
❕┇ الرابط – القوانين – الترحيب
❕┇ نزلني – اطردني 
❕┇ عدد الاضافه – المطور  
 ٴ━━━━━━━━━━
🔘┇ اسم البوت + الامر ↑↓
 ٴ━━━━━━━━━━
✳️┇  بوسه بالرد 
✳️┇ شنو رئيك بهاذا بالرد
✳️┇ شنو رئيك بهاي بالرد
 ٴ━━━━━━━━━━
⚜️┇ للمزيد من المعلومات راسلنا  ࿈
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م3' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن الادمنيه ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘┇ اهلا بك 
✳️┇ في اوامر الكتم والحظر ....
 ٴ━━━━━━━━━━
❕┇ كتم » { ايدي › معرف › رد }
❕┇ الغاء الكتم » { ايدي › معرف › رد }
❕┇ تقيد » { ايدي › معرف › رد }
❕┇ الغاء تقيد » { ايدي › معرف › رد }
❕┇ حظر » { ايدي › معرف › رد }
❕┇ الغاء الحظر » { ايدي › معرف › رد }
❕┇ طرد » { ايدي › معرف › رد }
❕┇ رفع القيود » { ايدي › معرف › رد }
 ٴ━━━━━━━━━━
💬┇ للمزيد من المعلومات راسلنا  ࿈
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م4' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*📬┇ انت لست ضمن الادمنيه 👁️‍🗨️\n📌┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n💥", 1, "md")  
return false end
mohmad = [[
*✳️┇ اهلا بك
🔘┇ في اوامر الادمنيه
 ٴ━━━━━━━━━━
🎖┇ رفع مميز
🎖┇ تنزيل مميز
🎖┇ تثبيت 
 ٴ━━━━━━━━━━
🌐┇ اوامر التفعيل و التعطيل ★
 ٴ━━━━━━━━━━
📄┇ تڤعيل – تعطيل – اطردني 
📄┇ تڤعيل – تعطيل – الترحيب 
📄┇ تڤعيل – تعطيل – جلب الصور 
📄┇ تڤعيل – تعطيل–  الترحيب 
 ٴ━━━━━━━━━━
🔘┇ اوامر الوضع
 ٴ━━━━━━━━━━
📊┇ ضع رابط » ثم ارسل الرابط
📊┇ ضع صوره » ثم ارسل الصوره
📊┇ ضع قوانين » ثم ارسل النص
📊┇ ضع ترحيب » ثم ارسل النص
📊┇ ضع وصف » ثم ارسل النص
 ٴ━━━━━━━━━━
⚜┇ مسح + الامر ادناه ↑↓
 ٴ━━━━━━━━━━
🗑┇ مسح المحظورين ٭
🗑┇ مسح المكتومين ٭
🗑┇ مسح المميزين ٭
🗑┇ مسح المقيدين ٭
🗑┇ مسح قائمهه المنع ٭
🗑┇ مسح القوانين ٭
🗑┇ مسح الترحيب ٭
🗑┇ مسح الرابط ٭
 ٴ━━━━━━━━━━
📋┇لعرض القوائم ↑↓
 ٴ━━━━━━━━━━
🚫┇ قائمهه المنع «
📊┇ القوانين «
📄┇ الرابط «
✳️┇ المميزين «
🚫┇ المقيدين «
🔘┇ المحظورين «
📊┇ المگتومين «
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م5' then
if not is_monsh(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن المدراء ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘┇ مرحبا بك
📋┇ في اوامــر المدراء 
 ٴ━━━━━━━━━━
❕┇ الآدمنيه
❕┇ رفع الادمنيه
❕┇ مسح الادمنيه
❕┇ مسح + العدد 
❕┇ مسح البوتات 
❕┇ الاعدادات 
❕┇ اعدادات الكتم
❕┇ اعدادات التقيد 
❕┇ اعدادات الطرد 
 ٴ━━━━━━━━━━
🔘┇ اوآمر الردود 
 ٴ━━━━━━━━━━
📊┇ اضف رد 
🚫┇ حذف رد 
📋┇ قائمه الردود 
🚫┇ مسح الردود 
ٴ━━━━━━━━━━
🔘┇ اوآمر الردود بالرد 
 ٴ━━━━━━━━━━
📄┇ اضف رد بالرد 
📄┇ حذف رد بالرد
📄┇ قائمه ردود بالرد 
📄┇ مسح ردود بالرد  
 ٴ━━━━━━━━━━
🔘┇ اوآمر تفعيل و التعطيل 
 ٴ━━━━━━━━━━
🌐┇ تفعيل ‹› تعطيل » نزلني 
🌐┇ تفعيل ‹› تعطيل » الايدي 
🌐┇ تفعيل ‹› تعطيل » الزخرفه 
🌐┇ تفعيل ‹› تعطيل » ردود البوت  
🌐┇ تفعيل ‹› تعطيل » الردود  
🌐┇ تفعيل ‹› تعطيل » الردود بالرد 
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م6' then
if not is_owner(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن المنشئين ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘┇ مرحبا بك
📋┇ في اوامــر المنشئين
 ٴ━━━━━━━━━━
❕┇ غادر !
❕┇ رفع مدير – تنزيل مدير 
❕┇ المدراء – المنشئين 
❕┇ مسح المدراء 
 ٴ━━━━━━━━━━
☑┇ تفعيل الاضافه ‹› تعطيل الاضافه
🌐┇ ضع عدد الاضافه + العدد
📊┇ ضع اسم + الاسم التريدهه
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م7' then
if not is_sudo(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست ضمن المطورين ♦\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘┇ مرحبا بك
🌐┇ في اوامــر المطورين .
ٴ━━━━━━━━━━
📊┇ تفعيل – تعطيل  
📊┇ الكروبات – المشتركين 
📊┇ رفع منشئ – تنزيل منشئ 
 📊┇ مسح المنشئين – المنشئين 
ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'م8' then
if not is_devmohmad(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*🔘┇ انت لست المطور الاساسي 👁️‍🗨️\n🌐┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🌐┇ مرحبا بك •
🔘┇ في اوامــر المطور الاساسي
ٴ━━━━━━━━━━
💬┇ ارسل الاوامر في الخاص
🚫┇ حظر + ايدي الكروب
⚜┇ الغاء الحظر + ايدي الكروب
ٴ━━━━━━━━━━
👤┇ رفع مطور – تنزيل مطور   
👥┇ المطَورين – مسح المطورين
📊┇ رفع مميز عام – تنزيل مميز عام
🚫┇ المميزين عام – مسح المميزين عام
🚫┇ حظر عام – الغاء العام 
🚫┇قائمهَ العام – مسح قائمه العام
ٴ━━━━━━━━━━
🔘┇ ردود المطور - مسح ردود المطور
🔘┇ تفعيل ردود المطور
🔘┇ تعطيل ردود المطور 
🔘┇ اضف رد عام - مسح رد عام 
🔘┇ ردود المطور بالرد 
🔘┇ مسح ردود المطور بالرد
🔘┇ تفعيل ردود المطور بالرد
🔘┇ تعطيل ردود المطور بالرد
🔘┇ اضف رد عام بالرد 
🔘┇ حذف رد عام بالرد 
ٴ━━━━━━━━━━
🌐┇ وضع اسم للبوت 
🌐┇ اذاعه + ايدي لكروب 
🌐┇ اذاعه
🌐┇ اذاعه خاص
🌐┇ اذاعه عام
🌐┇ اذاعه بالتوجيه
🌐┇ اذاعه خاص بالتوجيه
🌐┇ اذاعه عام بالتوجيه
ٴ━━━━━━━━━━
⏺┇ تغير الايدي — مسح تغير الايدي
⏺┇ ضع كليشه المطور 
⏺┇ حذف كليشه المطور
⏺┇ ضع كليشه ستارت 
⏺┇ حذف كليشه ستارت 
⏺┇ ضع رد تواصل
⏺┇ حذف رد التواصل
⏺┇ ضع عدد التفعيل   
⏺┇ جلب كليشه ستارت
⏺┇ جلب رد التواصل
ٴ━━━━━━━━━━
📊┇ تحديث السورس 
📊┇ مسح المجموعات 
📊┇ مسح المشتركين 
📊┇ غادر + الايدي
📊┇ تنظيف المجموعات 
📊┇ تنظيف المشتركين
ٴ━━━━━━━━━━
📄┇ وضع اسم البوت
📄┇ تفعيل التواصل
📄┇ تعطيل التواصل
📄┇ تفعيل البوت الخدمي
📄┇ تعطيل البوت الخدمي
📄┇تغير كليشه الترحيب
ٴ━━━━━━━━━━
❕┇ المشتركين – المجموعات 
❕┇ الاحصائيات – الكروبات
❕┇ معلومات ‹+› ايدي الكروب
❕┇ جلب الرابط ‹+› ايدي الكروب
❕┇ تغير الاشتراك 
❕┇ تغير رساله الاشتراك
❕┇ حذف رساله الاشتراك
❕┇ تفعيل الاشتراك الاجباري
❕┇ تعطيل الاشتراك الاجباري
❕┇ الاشتراك الاجباري
ٴ━━━━━━━━━━
🗂┇ الملفات — المتجر
🗂┇ تفعيل ملف + اسم الملف
🗂┇ تعطيل ملف + اسم الملف
ٴ━━━━━━━━━━
💬┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end
if MSG_TEXT[1] == 'اوامر التقيد' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*❕┇ انت لست ضمن الادمنيه ♦\n🔘┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘 ┇ اهلا بك في اوامر القفل بالتقيد
🔒 ┇ قفل ‹› فتح » بالتقيد
 ٴ━━━━━━━━━━
📊┇ الروابط / المعرفات
❕┇ الشارحهه / الصوت 
📡┇ الملفات / المتحركه
📋┇ التاك / الصور / الماركداون
🌐┇ الملصقات / الفيديو
📋┇ اللستات / الكلايش
🔱┇ التوجيه / الاغاني
⚠️┇ الجهات / السيلفي 
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'اوامر الطرد' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*📬┇ انت لست ضمن الادمنيه 👁️‍🗨️\n📌┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n💥", 1, "md")  
return false end
mohmad = [[
*🔘┇ اهلا بك في اوامر القفل بالطرد
🔒┇ قفلٰ ‹› فتح » بالطرد
 ٴ━━━━━━━━━━
📊┇ الروابط / المعرفات
❕┇ الشارحه / الصوت
📡┇ الملفات / المتحركه
📋┇ التاك / الصور / الماركداون
🌐┇ الملصقات / الفيديو
📋┇ اللستات / الكلايش
⚠️┇ التوجيه / الاغاني
🔘┇ الجهات / السيلفي 
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

if MSG_TEXT[1] == 'اوامر الكتم' then
if not is_mod(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*💬┇ انت لست ضمن الادمنيه ♦\n❕┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*🔘┇ اهلا بك في اوامر القفل بالگتم
  🔒┇ قفل /  فتح > بالكتم
 ٴ━━━━━━━━━━
❕┇ الروابط / المعرفات
📊┇ الشارحه / الصوت
📡┇ الملفات / المتحركه
📋┇ التاك / الصور / الماركداون
🔘┇ الملصقات / الفيديو
🔱┇ اللستات / الكلايش
🌐┇ التوجيه / الاغاني
⚠️┇ الجهات / السيلفي 
 ٴ━━━━━━━━━━
💬️┇ للمزيد من المعلومات راسلنا  ✅
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end
if MSG_TEXT[1] == 'اوامر الصلاحيات' then
if not is_owner(msg) then 
berof_sendMsg(msg.chat_id_, msg.id_, 1, "*👥┇ انت لست ضمن المنشئين ♦\n💬┇ يمكنك ارسال { م2 } لعرض قائمة اوامر خاصه في الاعضاء *\n♦", 1, "md")  
return false end
mohmad = [[
*📊┇ اهلا بك في اوامر الصلاحيات
🔒┇ قفل /  فتح » الامر
🔘┇ تعمل الاوامر التاليه بالرد او المعرف
 ٴ━━━━━━━━━━
📋┇ الروابط /  المعرفات
❕┇ الماركداون / الصوت
🌐┇ الصور / المتحركه
⚠️┇ الفيديو / الاونلاين
🔱┇ الملصقات / التثبيت
🔘┇ التوجيه / السيفلي
 ٴ━━━━━━━━━━
🔘┇ صلاحيات » { الحظر و الطرد }
 ٴ━━━━━━━━━━
📋┇ قفل الحظر » { رد «» معرف }
📊┇ فتح الحظر » { رد «» معرف }
❕┇ منح الحظر » { رد «» معرف }
🚫┇ الغاء منح الحظر » { رد «» معرف }
🌐┇ مسح صلاحيات الحظر
??┇ صلاحيات الحظر
⚠️┇ تفعيل «» تعطيل » الحظر 
 ٴ━━━━━━━━━━
💬┇ للمزيد من المعلومات راسلنا  ࿈
🗯┇ مطور البوت »* []] ..SUDOUSERNAME..[[]
]]
berof_sendMsg(msg.chat_id_, msg.id_, 1,mohmad, 1, 'md') 
end

end
end
return {
CMDS = {
"^(الاوامر)$",
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(م4)$",
"^(م5)$",
"^(م6)$",
"^(م7)$",
"^(م8)$",
"^(اوامر التقييد)$",
"^(اوامر الطرد)$",
"^(اوامر الكتم)$",
"^(تفعيل ردود البوت)$",
"^(تعطيل ردود البوت)$",
"^(اوامر الصلاحيات)$",
"^(رابط الحذف)$",
"^(رابط حذف)$",
"^(راح احذف)$",
"^(اريد احذف)$",
},
BEROF = help_rep,
BEROF_TEXT = GET_TEXT
}

